{
  "version": "1.0",
  "page": "curriculum",
  "data": {
    "header": {
      "title": "Webitor Primary School",
      "tagline": "Inspiring Young Minds"
    },
    "page_header": {
      "title": "Our Curriculum",
      "subtitle": "A broad and balanced education for every child"
    },
    "overview": {
      "heading": "Curriculum Overview",
      "paragraphs": [
        "At Webitor Primary, we follow the National Curriculum while enriching it with exciting, creative opportunities that inspire our pupils to become lifelong learners. Our curriculum is carefully designed to build knowledge and skills progressively from Reception through to Year 6.",
        "We believe in a knowledge-rich curriculum that develops children's understanding of the world while fostering creativity, critical thinking, and problem-solving skills."
      ]
    },
    "core_subjects": {
      "heading": "Core Subjects",
      "subjects": [
        {
          "icon": "📖",
          "title": "English",
          "description": "We prioritize reading, writing, and spoken language. Our phonics programme ensures every child becomes a confident reader."
        },
        {
          "icon": "🔢",
          "title": "Mathematics",
          "description": "Using a mastery approach, children develop deep understanding of mathematical concepts and problem-solving skills."
        },
        {
          "icon": "🔬",
          "title": "Science",
          "description": "Hands-on investigations and experiments bring scientific concepts to life and nurture curiosity about the natural world."
        }
      ]
    },
    "foundation_subjects": {
      "heading": "Foundation Subjects",
      "subjects": [
        {
          "icon": "🌍",
          "title": "Geography",
          "description": "Exploring the world's physical and human features, developing understanding of diverse places and cultures."
        },
        {
          "icon": "🏛️",
          "title": "History",
          "description": "Bringing the past to life through engaging topics from Ancient Egypt to World War II."
        },
        {
          "icon": "🎨",
          "title": "Art & Design",
          "description": "Developing creativity and technical skills through drawing, painting, sculpture, and digital art."
        },
        {
          "icon": "🎵",
          "title": "Music",
          "description": "Learning to play instruments, sing, and appreciate music from different traditions and genres."
        },
        {
          "icon": "💻",
          "title": "Computing",
          "description": "Developing digital literacy, coding skills, and understanding of online safety."
        },
        {
          "icon": "⚽",
          "title": "Physical Education",
          "description": "Building fitness, coordination, and teamwork through sports, gymnastics, and dance."
        },
        {
          "icon": "🙏",
          "title": "RE & PSHE",
          "description": "Understanding beliefs, values, and personal development including health and wellbeing."
        },
        {
          "icon": "🇫🇷",
          "title": "Modern Languages",
          "description": "KS2 pupils learn French, developing language skills and cultural awareness."
        }
      ]
    },
    "eyfs": {
      "heading": "Early Years Foundation Stage",
      "description": "Our Reception class provides a stimulating environment where children learn through play and structured activities. We follow the Early Years Foundation Stage framework, focusing on seven areas of learning:",
      "areas": [
        "Communication and Language",
        "Physical Development",
        "Personal, Social and Emotional Development",
        "Literacy",
        "Mathematics",
        "Understanding the World",
        "Expressive Arts and Design"
      ],
      "image": "images/eyfs-learning.jpg",
      "image_alt": "Early years children learning"
    },
    "reading": {
      "heading": "Reading at Webitor",
      "paragraphs": [
        "Reading is at the heart of our curriculum. We use a systematic phonics programme (Read Write Inc.) to teach early reading, ensuring all children develop strong decoding skills.",
        "Every child has daily reading opportunities, and we encourage reading for pleasure through our well-stocked library, book corners in every classroom, and author visits."
      ],
      "reading_milestones": {
        "heading": "Reading Milestones",
        "description": "We celebrate reading achievement through our Bronze, Silver, and Gold reading awards. Children who read regularly at home and complete reading challenges earn certificates and prizes."
      }
    },
    "enrichment": {
      "heading": "Extended Curriculum & Enrichment",
      "activities": [
        {
          "title": "Sports & Fitness",
          "description": "Football, netball, athletics, gymnastics, and swimming clubs",
          "image": "images/sports-club.jpg",
          "image_alt": "Sports activities"
        },
        {
          "title": "Performing Arts",
          "description": "Drama, choir, school productions, and music lessons",
          "image": "images/drama-club.jpg",
          "image_alt": "Drama performance"
        },
        {
          "title": "STEM Clubs",
          "description": "Coding, robotics, science experiments, and maths challenges",
          "image": "images/coding-club.jpg",
          "image_alt": "Children coding"
        },
        {
          "title": "Creative Arts",
          "description": "Art club, craft activities, and creative writing workshops",
          "image": "images/art-club.jpg",
          "image_alt": "Art activities"
        }
      ]
    },
    "send": {
      "heading": "Special Educational Needs",
      "paragraphs": [
        "We are committed to ensuring that all children, regardless of their individual needs, receive the support they require to thrive. Our SENCO works closely with teachers, parents, and external agencies to provide tailored support for children with special educational needs and disabilities (SEND).",
        "We offer a range of interventions including speech and language therapy, literacy and numeracy support, social skills groups, and sensory breaks."
      ]
    },
    "footer": {
      "school_info": {
        "heading": "Webitor Primary School",
        "address": "123 Education Lane\nLondon, SW1A 1AA\nUnited Kingdom"
      },
      "contact_info": {
        "heading": "Contact Us",
        "details": "Tel: 020 1234 5678\nEmail: office@webitorprimary.sch.uk\nMonday-Friday: 8:00am - 4:00pm"
      },
      "copyright": "© 2026 Webitor Primary School. All rights reserved."
    }
  }
}
